OpenROAD c1c315118e68926dfff368f85e13bf50adaa920f 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/current/runs/RUN__2022_06_04__22_38_23/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/current/runs/RUN__2022_06_04__22_38_23/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/current/runs/RUN__2022_06_04__22_38_23/tmp/floorplan/6-pdn.def
[INFO ODB-0128] Design: multiplexer
[INFO ODB-0130]     Created 14 pins.
[INFO ODB-0131]     Created 252 components and 692 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 672 connections.
[INFO ODB-0133]     Created 15 nets and 20 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/current/runs/RUN__2022_06_04__22_38_23/tmp/floorplan/6-pdn.def
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 115000 119680
[INFO GPL-0006] NumInstances: 252
[INFO GPL-0007] NumPlaceInstances: 4
[INFO GPL-0008] NumFixedInstances: 248
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 15
[INFO GPL-0011] NumPins: 32
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 120635 131355
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 115000 119680
[INFO GPL-0016] CoreArea: 11911424000
[INFO GPL-0017] NonPlaceInstsArea: 510489600
[INFO GPL-0018] PlaceInstsArea: 60057600
[INFO GPL-0019] Util(%): 0.53
[INFO GPL-0020] StdInstsArea: 60057600
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG residual: 0.00000003 HPWL: 1582740
[InitialPlace]  Iter: 2 CG residual: 0.00000001 HPWL: 1262909
[InitialPlace]  Iter: 3 CG residual: 0.00000001 HPWL: 1260648
[InitialPlace]  Iter: 4 CG residual: 0.00000004 HPWL: 1257621
[InitialPlace]  Iter: 5 CG residual: 0.00000000 HPWL: 1253581
[INFO GPL-0031] FillerInit: NumGCells: 500
[INFO GPL-0032] FillerInit: NumGNets: 15
[INFO GPL-0033] FillerInit: NumGPins: 32
[INFO GPL-0023] TargetDensity: 0.55
[INFO GPL-0024] AveragePlaceInstArea: 15014400
[INFO GPL-0025] IdealBinArea: 27298908
[INFO GPL-0026] IdealBinCnt: 436
[INFO GPL-0027] TotalBinArea: 11911424000
[INFO GPL-0028] BinCnt: 16 16
[INFO GPL-0029] BinSize: 6843 6800
[INFO GPL-0030] NumBins: 256
[NesterovSolve] Iter: 1 overflow: 0 HPWL: 1133311
[NesterovSolve] Finished with Overflow: 0.000000
###############################################################################
# Created by write_sdc
# Sat Jun  4 19:38:27 2022
###############################################################################
current_design multiplexer
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[0]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[1]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[2]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[3]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[4]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[5]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[6]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in[7]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sel[0]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sel[1]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sel[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sel[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sel[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sel[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: sel[2] (input port clocked by __VIRTUAL_CLK__)
Endpoint: out (output port clocked by __VIRTUAL_CLK__)
Path Group: __VIRTUAL_CLK__
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.00    0.00    0.00   clock __VIRTUAL_CLK__ (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 v input external delay
                  0.02    0.01    2.01 v sel[2] (in)
     1    0.01                           sel[2] (net)
                  0.02    0.00    2.01 v _5_/S (sky130_fd_sc_hd__mux2_2)
                  0.05    0.24    2.25 v _5_/X (sky130_fd_sc_hd__mux2_2)
     1    0.00                           _2_ (net)
                  0.05    0.00    2.25 v _6_/A (sky130_fd_sc_hd__buf_1)
                  0.23    0.23    2.49 v _6_/X (sky130_fd_sc_hd__buf_1)
     1    0.03                           out (net)
                  0.23    0.00    2.49 v out (out)
                                  2.49   data arrival time

                  0.00    0.00    0.00   clock __VIRTUAL_CLK__ (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                         -2.00   -1.75   output external delay
                                 -1.75   data required time
-----------------------------------------------------------------------------
                                 -1.75   data required time
                                 -2.49   data arrival time
-----------------------------------------------------------------------------
                                  4.24   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: sel[0] (input port clocked by __VIRTUAL_CLK__)
Endpoint: out (output port clocked by __VIRTUAL_CLK__)
Path Group: __VIRTUAL_CLK__
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.00    0.00    0.00   clock __VIRTUAL_CLK__ (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.11    0.08    2.08 ^ sel[0] (in)
     2    0.02                           sel[0] (net)
                  0.11    0.00    2.08 ^ _4_/S0 (sky130_fd_sc_hd__mux4_2)
                  0.08    0.52    2.59 v _4_/X (sky130_fd_sc_hd__mux4_2)
     1    0.00                           _1_ (net)
                  0.08    0.00    2.59 v _5_/A1 (sky130_fd_sc_hd__mux2_2)
                  0.05    0.28    2.87 v _5_/X (sky130_fd_sc_hd__mux2_2)
     1    0.00                           _2_ (net)
                  0.05    0.00    2.87 v _6_/A (sky130_fd_sc_hd__buf_1)
                  0.23    0.26    3.13 v _6_/X (sky130_fd_sc_hd__buf_1)
     1    0.03                           out (net)
                  0.23    0.00    3.13 v out (out)
                                  3.13   data arrival time

                  0.00   10.00   10.00   clock __VIRTUAL_CLK__ (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -3.13   data arrival time
-----------------------------------------------------------------------------
                                  4.62   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: sel[0] (input port clocked by __VIRTUAL_CLK__)
Endpoint: out (output port clocked by __VIRTUAL_CLK__)
Path Group: __VIRTUAL_CLK__
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.00    0.00    0.00   clock __VIRTUAL_CLK__ (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.11    0.08    2.08 ^ sel[0] (in)
     2    0.02                           sel[0] (net)
                  0.11    0.00    2.08 ^ _4_/S0 (sky130_fd_sc_hd__mux4_2)
                  0.08    0.52    2.59 v _4_/X (sky130_fd_sc_hd__mux4_2)
     1    0.00                           _1_ (net)
                  0.08    0.00    2.59 v _5_/A1 (sky130_fd_sc_hd__mux2_2)
                  0.05    0.28    2.87 v _5_/X (sky130_fd_sc_hd__mux2_2)
     1    0.00                           _2_ (net)
                  0.05    0.00    2.87 v _6_/A (sky130_fd_sc_hd__buf_1)
                  0.23    0.26    3.13 v _6_/X (sky130_fd_sc_hd__buf_1)
     1    0.03                           out (net)
                  0.23    0.00    3.13 v out (out)
                                  3.13   data arrival time

                  0.00   10.00   10.00   clock __VIRTUAL_CLK__ (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -3.13   data arrival time
-----------------------------------------------------------------------------
                                  4.62   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 4.62

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 4.24
worst_slack_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          1.81e-06   1.49e-06   2.77e-10   3.30e-06 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  1.81e-06   1.49e-06   2.77e-10   3.30e-06 100.0%
                          54.8%      45.2%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 571 u^2 5% utilization.
area_report_end
